app/controllers/comments_controller.rb

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "updated_at" = $1 WHERE "comments"."id" = $2  [["updated_at", "2022-07-27 17:51:52.562785"], ["id", 15]]