app/controllers/comments_controller.rb

  def index
    @comments = Comment.where("user_id = #{current_user.id}").page params[:page]
    @publish = Publish.where("id = #{@comments.first.id}").page params[:page]
---
SELECT "comments".* FROM "comments" WHERE (user_id = 7) ORDER BY "comments"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "publishes".* FROM "publishes" WHERE (id = 15) LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]

  def show
    @publicacion = Publish.where("id = #{@comment.id}").page params[:page]
---
SELECT "publishes".* FROM "publishes" WHERE (id = 15) LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]

  def new
    @publicacion = Publish.where("id = #{params[:format]}")
---
SELECT "publishes".* FROM "publishes" WHERE (id = 17)

  def create
    @comment = Comment.new(comment_params)
    @comment.publish_id = comment_params[:publish_id]
    @comment.user_id = current_user.id
    publish = Publish.find_by_id(comment_params[:publish_id])
    @user = User.find_by_id(publish.user_id)
    respond_to do |format|
      if @comment.save
        UserMailer.with(user: @user).comunicados_comentarios.deliver_later
---
SELECT "publishes".* FROM "publishes" WHERE "publishes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "publishes".* FROM "publishes" WHERE "publishes"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "likes", "user_id", "publish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["commenter", nil], ["body", nil], ["likes", 0], ["user_id", 8], ["publish_id", 19], ["created_at", "2022-08-01 02:36:58.456700"], ["updated_at", "2022-08-01 02:36:58.456700"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "updated_at" = $1 WHERE "comments"."id" = $2  [["updated_at", "2022-08-01 02:36:58.476522"], ["id", 16]]