app/controllers/publishes_controller.rb

SELECT "publishes".* FROM "publishes" WHERE (content LIKE '%texto%' or title LIKE '%texto%') ORDER BY published_at DESC, created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "publishes" WHERE (content LIKE '%Soy un crack%' or title LIKE '%Soy un crack%') ORDER BY published_at DESC, created_at DESC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 2], ["OFFSET", 0]]
SELECT "publishes".* FROM "publishes" ORDER BY likes DESC LIMIT $1  [["LIMIT", 10]]
---
  def index
    if !params[:search].blank?
      q = params[:search]
      @publishes =  Publish.order("published_at DESC").search_content(q).page params[:page]
        if @publishes.size > 0

SELECT "publishes".* FROM "publishes" WHERE (user_id = 7) LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
---
  def user_publish
        @publishes = Publish.where("user_id = #{params[:id]}").page params[:page]

SELECT "comments".* FROM "comments" WHERE "comments"."publish_id" = $1 LIMIT $2 OFFSET $3  [["publish_id", 18], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."publish_id" = $1  [["publish_id", 18]]
---
  def show
    @comentarios = Comment.where(publish_id: @publish.id ).page params[:page]

INSERT INTO "publishes" ("title", "content", "published_at", "likes", "dislikes", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @publish = Publish.new(publish_params)
    #binding.break
    @publish.user_id = current_user.id
    @publish.published_at = Time.now
    respond_to do |format|
      if @publish.save

UPDATE "publishes" SET "updated_at" = $1 WHERE "publishes"."id" = $2  [["updated_at", "2022-07-27 17:53:48.884067"], ["id", 18]]
---
  def update
    respond_to do |format|
      if @publish.update(publish_params)

SELECT "publishes".* FROM "publishes" WHERE "publishes"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "publishes" SET "dislikes" = $1, "updated_at" = $2 WHERE "publishes"."id" = $3  [["dislikes", 1], ["updated_at", "2022-07-27 17:53:56.099382"], ["id", 18]]
---
  def likes_publish
    publish = Publish.find(params[:id])
    publish.likes = publish.counterLikes(params[:id]) if params[:format] == "likes"
    publish.dislikes = publish.counterdislikes(params[:id]) if params[:format] == "dislikes"
    publish.save(validate: false)

SELECT "publishes".* FROM "publishes" WHERE "publishes"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def set_publish
      @publish = Publish.find(params[:id])