app/models/publish.rb

    def counterLikes(id)
        where_str = "id = #{id}"
        count_likes = Publish.select(:likes).where(where_str)
            count_likes.each do |lk|
---
SELECT "publishes"."likes" FROM "publishes" WHERE (id = 17)

    def counterdislikes(id)
        where_str = "id = #{id}"
        count_likes = Publish.select(:dislikes).where(where_str)
            count_likes.each do |lk|
---
SELECT "publishes"."dislikes" FROM "publishes" WHERE (id = 18)